{
    "Moonlit Echoes Theme Presets": "ค่าที่ตั้งไว้ล่วงหน้าของธีม Moonlit Echoes",
    "Primary Theme Color": "สีธีมหลัก",
    "The main interface theme color, used for highlights and accents": "สีธีมหลักของอินเทอร์เฟซ ใช้สำหรับการเน้นและตกแต่ง",
    "Secondary Theme Color": "สีธีมรอง",
    "A complementary secondary color, used for special highlights": "สีรองที่ช่วยเสริมสีหลัก ใช้สำหรับการเน้นพิเศษ",
    "Top Menu Color": "สีเมนูด้านบน",
    "Background color of the top menu (#top-bar)": "สีพื้นหลังของเมนูด้านบน (#top-bar)",
    "Menu Icon Color": "สีไอคอนเมนู",
    "Color of icons in the top menu, sidebar, and dropdown menus": "สีของไอคอนในเมนูด้านบน แถบด้านข้าง และเมนูแบบเลื่อนลง",
    "Chat Field Background Color": "สีพื้นหลังช่องแชท",
    "Background color of the chat field (#sheld)": "สีพื้นหลังของช่องแชท (#sheld)",
    "Background Blur Intensity": "ความเบลอของพื้นหลัง",
    "Adjusts the blur level of the background image": "ปรับระดับความเบลอของภาพพื้นหลัง",
    "Chat Field Background Blur Intensity": "ความเบลอพื้นหลังช่องแชท",
    "Blur level of the chat field background (#sheld)": "ระดับความเบลอของพื้นหลังช่องแชท (#sheld)",
    "Chat Field Gradient Blur": "การเบลอแบบไล่ระดับของช่องแชท",
    "Subtle": "เล็กน้อย",
    "Applies a transparent gradient effect to the top and bottom of the chat field (#chat)": "ใช้เอฟเฟกต์การไล่ระดับสีแบบโปร่งใสที่ด้านบนและด้านล่างของช่องแชท (#chat)",
    "Chat Field Avatar Size": "ขนาดอวตารในช่องแชท",
    "Width and height of character avatars in the chat field": "ความกว้างและความสูงของอวตารตัวละครในช่องแชท",
    "[Echo] Message Background Avatar Width": "[Echo] ความกว้างอวตารพื้นหลังข้อความ",
    "Width of character avatars in the message background for the Echo style": "ความกว้างของอวตารตัวละครในพื้นหลังข้อความสำหรับสไตล์ Echo",
    "[Whisper] Message Background Avatar Width": "[Whisper] ความกว้างอวตารพื้นหลังข้อความ",
    "Width of character avatars in the message background for the Whisper style": "ความกว้างของอวตารตัวละครในพื้นหลังข้อความสำหรับสไตล์ Whisper",
    "[Whisper] Avatar Alignment": "[Whisper] การจัดตำแหน่งอวตาร",
    "Top Aligned": "จัดชิดบน",
    "Center Aligned": "จัดกึ่งกลาง",
    "Bottom Aligned": "จัดชิดล่าง",
    "Vertical alignment of character avatars in the message background for the Whisper style": "การจัดตำแหน่งแนวตั้งของอวตารตัวละครในพื้นหลังข้อความสำหรับสไตล์ Whisper",
    "Visual Novel Mode Chat Field Height": "ความสูงช่องแชทในโหมดวิชวลโนเวล",
    "Maximum height of the chat field (#sheld) in Visual Novel mode": "ความสูงสูงสุดของช่องแชท (#sheld) ในโหมดวิชวลโนเวล",
    "Visual Novel Mode Character Portrait Gradient Transparency": "ความโปร่งใสแบบไล่ระดับของภาพตัวละครในโหมดวิชวลโนเวล",
    "Bottom transparency effect for character portraits in Visual Novel mode": "เอฟเฟกต์ความโปร่งใสที่ด้านล่างของภาพตัวละครในโหมดวิชวลโนเวล",
    "Enable New Mobile Input Field": "เปิดใช้งานช่องป้อนข้อมูลสำหรับมือถือแบบใหม่",
    "A message input field designed for mobile, providing a wider input box": "ช่องป้อนข้อความที่ออกแบบมาสำหรับมือถือ มีกล่องป้อนข้อมูลที่กว้างขึ้น",
    "Enable Moonlit Echoes Theme": "เปิดใช้งานธีม Moonlit Echoes",
    "Echo": "Echo (เสียงสะท้อน)",
    "Whisper": "Whisper (เสียงกระซิบ)",
    "Hush": "Hush (ความเงียบ)",
    "Tide": "Tide (กระแสน้ำ)",
    "Theme Color Settings": "การตั้งค่าสีธีม",
    "Background Settings": "การตั้งค่าพื้นหลัง",
    "Chat Interface": "อินเทอร์เฟซแชท",
    "Visual Novel Mode": "โหมดวิชวลโนเวล",
    "General Settings": "การตั้งค่าทั่วไป",
    "Advanced Settings": "การตั้งค่าขั้นสูง",
    "You are currently using the third-party extension theme": "คุณกำลังใช้ธีมส่วนขยายของบุคคลที่สาม",
    "Thank you for choosing my theme! This extension is unofficial. For issues, please contact": "ขอบคุณที่เลือกธีมของฉัน! ส่วนขยายนี้ไม่เป็นทางการ หากมีปัญหา โปรดติดต่อ",
    "customThemeIssue": "ส่วนขยายธีมนี้ไม่เกี่ยวข้องกับ SillyTavern อย่างเป็นทางการ และอาจไม่เข้ากันกับธีมที่กำหนดเองทั้งหมด หากพบปัญหา โปรดตรวจสอบด้วยตนเองก่อน หากยืนยันว่าปัญหาเกิดจากส่วนขยายนี้ โปรดติดต่อ",
    "Invalid Moonlit Echoes theme preset format": "รูปแบบค่าที่ตั้งไว้ล่วงหน้าของธีม Moonlit Echoes ไม่ถูกต้อง",
    "Moonlit Echoes theme preset \"${0}\" not found": "ไม่พบค่าที่ตั้งไว้ล่วงหน้าของธีม Moonlit Echoes \"${0}\"",
    "Moonlit Echoes theme preset \"${0}\" exported successfully": "ส่งออกค่าที่ตั้งไว้ล่วงหน้าของธีม Moonlit Echoes \"${0}\" สำเร็จแล้ว",
    "Moonlit Echoes theme preset \"${0}\" updated successfully": "อัปเดตค่าที่ตั้งไว้ล่วงหน้าของธีม Moonlit Echoes \"${0}\" สำเร็จแล้ว",
    "Save New Moonlit Echoes Theme Preset": "บันทึกค่าที่ตั้งไว้ล่วงหน้าของธีม Moonlit Echoes ใหม่",
    "Please enter a name for your new Moonlit Echoes theme preset:": "โปรดป้อนชื่อสำหรับค่าที่ตั้งไว้ล่วงหน้าของธีม Moonlit Echoes ใหม่ของคุณ:",
    "Confirm Overwrite": "ยืนยันการเขียนทับ",
    "A preset named \"${0}\" already exists. Do you want to overwrite it?": "มีค่าที่ตั้งไว้ล่วงหน้าที่ชื่อ \"${0}\" อยู่แล้ว คุณต้องการเขียนทับหรือไม่",
    "Preset \"${0}\" saved successfully": "บันทึกค่าที่ตั้งไว้ล่วงหน้า \"${0}\" สำเร็จแล้ว",
    "Cannot delete the only preset": "ไม่สามารถลบค่าที่ตั้งไว้ล่วงหน้าเพียงค่าเดียวได้",
    "Cannot delete the Moonlit Echoes theme preset": "ไม่สามารถลบค่าที่ตั้งไว้ล่วงหน้าของธีม Moonlit Echoes ได้",
    "File input element not found": "ไม่พบองค์ประกอบการป้อนข้อมูลไฟล์",
    "Invalid Moonlit Echoes theme preset file format": "รูปแบบไฟล์ค่าที่ตั้งไว้ล่วงหน้าของธีม Moonlit Echoes ไม่ถูกต้อง",
    "Delete Theme Preset": "ลบค่าที่ตั้งไว้ล่วงหน้าของธีม",
    "Are you sure you want to delete the preset \"${0}\"?": "คุณแน่ใจหรือไม่ว่าต้องการลบค่าที่ตั้งไว้ล่วงหน้า \"${0}\"",
    "Preset \"${0}\" imported successfully": "นำเข้าค่าที่ตั้งไว้ล่วงหน้า \"${0}\" สำเร็จแล้ว",
    "Import Preset": "นำเข้าค่าที่ตั้งไว้ล่วงหน้า",
    "Export Preset": "ส่งออกค่าที่ตั้งไว้ล่วงหน้า",
    "Update Current Preset": "อัปเดตค่าที่ตั้งไว้ล่วงหน้าปัจจุบัน",
    "Save as New Preset": "บันทึกเป็นค่าที่ตั้งไว้ล่วงหน้าใหม่",
    "Delete Preset": "ลบค่าที่ตั้งไว้ล่วงหน้า",
    "Error importing preset:": "เกิดข้อผิดพลาดในการนำเข้าค่าที่ตั้งไว้ล่วงหน้า:",
    "Blurry or thumbnail-sized character images in chat?": "ภาพตัวละครในแชทเบลอหรือมีขนาดเล็กเหมือนภาพขนาดย่อหรือไม่",
    "SillyTavern's default thumbnail scaling causes avatars to use lower-resolution images. fix this, edit": "การปรับขนาดภาพขนาดย่อเริ่มต้นของ SillyTavern ทำให้อวตารใช้ภาพความละเอียดต่ำ หากต้องการแก้ไข โปรดแก้ไข",
    "and fully restart the SillyTavern server.": "และรีสตาร์ทเซิร์ฟเวอร์ SillyTavern ทั้งหมด",
    "Recommended settings (please scroll):": "การตั้งค่าที่แนะนำ (โปรดเลื่อนดู):",
    "Ripple": "Ripple (ระลอกคลื่น)",
    "[Ripple] Message Avatar Width": "[Ripple] ความกว้างอวตารในข้อความ",
    "Width of character avatars in the message for the Ripple style": "ความกว้างของอวตารตัวละครในข้อความสำหรับสไตล์ Ripple",
    "[Ripple] Mobile Message Avatar Width": "[Ripple] ความกว้างอวตารในข้อความสำหรับมือถือ",
    "Width of character avatars in the message for the mobile Ripple style": "ความกว้างของอวตารตัวละครในข้อความสำหรับสไตล์ Ripple บนมือถือ",
    "Hide Additional Message Details": "ซ่อนรายละเอียดข้อความเพิ่มเติม",
    "Message additional details (name, ID, time, token counter, etc.) show only on hover or click": "รายละเอียดเพิ่มเติมของข้อความ (ชื่อ, ID, เวลา, ตัวนับโทเค็น ฯลฯ) จะแสดงเมื่อวางเมาส์เหนือหรือคลิกเท่านั้น",
    "Preset \"${0}\" deleted successfully": "ลบค่าที่ตั้งไว้ล่วงหน้า \"${0}\" สำเร็จแล้ว",
    "Message Details Animation Duration": "ระยะเวลาแอนิเมชันของรายละเอียดข้อความ",
    "Controls the animation speed for message details appearing/disappearing (e.g. 0.5s, 1.2s)": "ควบคุมความเร็วของแอนิเมชันในการปรากฏ/หายไปของรายละเอียดข้อความ (เช่น 0.5 วินาที, 1.2 วินาที)",
    "Scrollbar Color": "สีแถบเลื่อน",
    "The scrollbar color on SillyTavern": "สีของแถบเลื่อนบน SillyTavern",
    "Maximum Context Marker Style": "สไตล์เครื่องหมายบริบทสูงสุด",
    "Line style for the maximum context marker": "สไตล์เส้นสำหรับเครื่องหมายบริบทสูงสุด",
    "Main Background Color": "สีพื้นหลังหลัก",
    "The primary background color used across various menus and buttons": "สีพื้นหลังหลักที่ใช้ในเมนูและปุ่มต่างๆ",
    "Secondary Background Color": "สีพื้นหลังรอง",
    "The secondary background color used across various menus and buttons": "สีพื้นหลังรองที่ใช้ในเมนูและปุ่มต่างๆ",
    "Background Image Opacity": "ความทึบของภาพพื้นหลัง",
    "Adjusts the opacity level of the background image": "ปรับระดับความทึบของภาพพื้นหลัง",
    "[Echo] Message Background Avatar Height": "[Echo] ความสูงอวตารพื้นหลังข้อความ",
    "Height of character avatars in the message background for the Echo style": "ความสูงของอวตารตัวละครในพื้นหลังข้อความสำหรับสไตล์ Echo",
    "Justify Paragraph Text": "จัดแนวข้อความย่อหน้าแบบเต็มขอบ",
    "Aligns paragraph text for Chinese, Japanese, and Korean for better readability; not suitable for English layout": "จัดแนวข้อความย่อหน้าสำหรับภาษาจีน ญี่ปุ่น และเกาหลีเพื่อให้อ่านง่ายขึ้น ไม่เหมาะสำหรับเค้าโครงภาษาอังกฤษ",
    "Please refer to the": "โปรดอ้างอิงถึง",
    "and complete the necessary setup.": "และทำการตั้งค่าที่จำเป็นให้เสร็จสิ้น",
    "Fix Tablet Menu Layout": "แก้ไขเค้าโครงเมนูแท็บเล็ต",
    "Optimized for tablet users to prevent menu layout issues. Note: Tablet support in SillyTavern is currently limited and may not address all issues": "ปรับให้เหมาะกับผู้ใช้แท็บเล็ตเพื่อป้องกันปัญหาเค้าโครงเมนู หมายเหตุ: การรองรับแท็บเล็ตใน SillyTavern ยังมีจำกัดและอาจไม่สามารถแก้ไขปัญหาทั้งหมดได้",
    "Enable Mobile Hidden Scrollbar": "เปิดใช้งานแถบเลื่อนที่ซ่อนไว้บนมือถือ",
    "Hides scrollbars for a clean mobile interface": "ซ่อนแถบเลื่อนเพื่ออินเทอร์เฟซที่สะอาดตาบนมือถือ",
    "Apply Theme Colors to More UI Elements": "ใช้สีธีมกับองค์ประกอบ UI เพิ่มเติม",
    "Applies theme colors to more parts of the UI for a more personalized look": "ใช้สีธีมกับส่วนต่างๆ ของ UI มากขึ้นเพื่อรูปลักษณ์ที่เป็นส่วนตัวยิ่งขึ้น",
    "Enable Horizontal HotSwap Scroll on Mobile": "เปิดใช้งานการเลื่อน HotSwap แนวนอนบนมือถือ",
    "Allows horizontal scrolling for the quick character selection menu (#HotSwapWrapper) on mobile": "อนุญาตให้เลื่อนแนวนอนสำหรับเมนูเลือกตัวละครด่วน (#HotSwapWrapper) บนมือถือ",
    "Increase Chat Input Field Spacing on Desktop & Tablet": "เพิ่มระยะห่างช่องป้อนข้อมูลแชทบนเดสก์ท็อปและแท็บเล็ต",
    "Add extra bottom margin to chat input fields on larger screens (tablets and desktops)": "เพิ่มระยะขอบด้านล่างเพิ่มเติมให้กับช่องป้อนข้อมูลแชทบนหน้าจอที่ใหญ่ขึ้น (แท็บเล็ตและเดสก์ท็อป)",
    "Increase Chat Input Field Spacing on Mobile": "เพิ่มระยะห่างช่องป้อนข้อมูลแชทบนมือถือ",
    "Add extra bottom padding to chat input fields on mobile devices (screen width ≤ 1000px)": "เพิ่มช่องว่างด้านล่างเพิ่มเติมให้กับช่องป้อนข้อมูลแชทบนอุปกรณ์มือถือ (ความกว้างหน้าจอ ≤ 1000px)",
    "[Echo] Mobile Message Background Avatar Width": "[Echo] ความกว้างอวตารพื้นหลังข้อความบนมือถือ",
    "Width of character avatars in the message background for the Echo style on mobile devices": "ความกว้างของอวตารตัวละครในพื้นหลังข้อความสำหรับสไตล์ Echo บนอุปกรณ์มือถือ",
    "[Echo] Mobile Message Background Avatar Height": "[Echo] ความสูงอวตารพื้นหลังข้อความบนมือถือ",
    "Height of character avatars in the message background for the Echo style on mobile devices": "ความสูงของอวตารตัวละครในพื้นหลังข้อความสำหรับสไตล์ Echo บนอุปกรณ์มือถือ",
    "Hide Mobile Echo-Style Message Background": "ซ่อนพื้นหลังข้อความสไตล์ Echo บนมือถือ",
    "Hide the echo-style background illustration for character messages on mobile devices": "ซ่อนภาพประกอบพื้นหลังสไตล์ Echo สำหรับข้อความตัวละครบนอุปกรณ์มือถือ",
    "Disable All Border Radius": "ปิดใช้งานมุมโค้งมนทั้งหมด",
    "Completely disable all border-radius and outline-radius effects throughout the UI": "ปิดใช้งานเอฟเฟกต์มุมโค้งมนและขอบโค้งมนทั้งหมดใน UI",
    "Hide Avatar Border": "ซ่อนเส้นขอบอวตาร",
    "Hide the border around character avatars in chat messages": "ซ่อนเส้นขอบรอบอวตารตัวละครในข้อความแชท",
    "Move QRs Bar Below Input on Mobile": "ย้ายแถบ QRs ไปไว้ใต้ช่องป้อนข้อมูลบนมือถือ",
    "On mobile devices (screen width ≤ 1000px), move the QRs menu below the chat input to avoid interference from message input": "บนอุปกรณ์มือถือ (ความกว้างหน้าจอ ≤ 1000px) ให้ย้ายเมนู QRs ไปไว้ใต้ช่องป้อนข้อมูลแชทเพื่อหลีกเลี่ยงการรบกวนจากการป้อนข้อความ",
    "Mobile QRs Bar Height": "ความสูงของแถบ QRs บนมือถือ",
    "Sets the maximum number of visible rows in the QRs bar on mobile devices (supports scrolling)": "กำหนดจำนวนแถวสูงสุดที่มองเห็นได้ในแถบ QRs บนอุปกรณ์มือถือ (รองรับการเลื่อน)",
    "Compact (1 row)": "กะทัดรัด (1 แถว)",
    "Default (2 rows)": "ค่าเริ่มต้น (2 แถว)",
    "Extended (3 rows)": "ขยาย (3 แถว)",
    "Message Paragraph Spacing": "ระยะห่างระหว่างย่อหน้าของข้อความ",
    "Sets the spacing between paragraphs in chat messages (e.g. 0.5em, 1em)": "กำหนดระยะห่างระหว่างย่อหน้าในข้อความแชท (เช่น 0.5em, 1em)",
    "Core Settings": "การตั้งค่าหลัก",
    "Background Effects": "เอฟเฟกต์พื้นหลัง",
    "Theme Extras": "ส่วนเสริมของธีม",
    "General Chat Settings": "การตั้งค่าแชททั่วไป",
    "Echo Style Settings": "การตั้งค่าสไตล์ Echo",
    "Whisper Style Settings": "การตั้งค่าสไตล์ Whisper",
    "Ripple Style Settings": "การตั้งค่าสไตล์ Ripple",
    "[Echo] Hide Message Background on Mobile": "[Echo] ซ่อนพื้นหลังข้อความบนมือถือ",
    "Hide message background illustrations on mobile for the Echo style": "ซ่อนภาพประกอบพื้นหลังข้อความบนมือถือสำหรับสไตล์ Echo",
    "Mobile Devices": "อุปกรณ์มือถือ",
    "Mobile Global Settings": "การตั้งค่าส่วนกลางสำหรับมือถือ",
    "Mobile Detailed Settings": "การตั้งค่าโดยละเอียดสำหรับมือถือ",
    "Open Moonlit Echoes Theme Settings": "เปิดการตั้งค่าธีม Moonlit Echoes",
    "Chat Style Slash Commands": "คำสั่ง Slash สำหรับสไตล์แชท",
    "Available commands:": "คำสั่งที่ใช้ได้:",
    "SillyTavern Safe Switch Commands:": "คำสั่งสลับที่ปลอดภัยของ SillyTavern:",
    "Switch to Echo style": "เปลี่ยนเป็นสไตล์ Echo (เสียงสะท้อน)",
    "Switch to Whisper style": "เปลี่ยนเป็นสไตล์ Whisper (เสียงกระซิบ)",
    "Switch to Hush style": "เปลี่ยนเป็นสไตล์ Hush (ความเงียบ)",
    "Switch to Ripple style": "เปลี่ยนเป็นสไตล์ Ripple (ระลอกคลื่น)",
    "Switch to Tide style": "เปลี่ยนเป็นสไตล์ Tide (กระแสน้ำ)",
    "Moonlit Echoes Styles:": "สไตล์ของ Moonlit Echoes:",
    "SillyTavern Built-in Styles:": "สไตล์ที่มีใน SillyTavern:",
    "Switch to Flat style": "เปลี่ยนเป็นสไตล์ Flat (แบน)",
    "Switch to Bubble style": "เปลี่ยนเป็นสไตล์ Bubble (ฟอง)",
    "Switch to Document style": "เปลี่ยนเป็นสไตล์ Document (เอกสาร)",
    "For more commands, see": "สำหรับคำสั่งเพิ่มเติม โปรดดูที่",
    "STscript Reference": "เอกสารอ้างอิง STscript",
    "Apply Theme Color to Message Avatar Border": "ใช้สีธีมกับเส้นขอบอวตารของข้อความ",
    "Applies each character’s theme color to message avatar borders. Requires the Character Style Customizer; per-character colors override global settings": "ใช้สีธีมของแต่ละตัวละครกับเส้นขอบอวตารของข้อความ ต้องใช้ส่วนขยาย Character Style Customizer; สีของแต่ละตัวละครจะแทนที่การตั้งค่าส่วนกลาง",
    "Mobile Chat Field Background Blur Intensity": "ความเบลอพื้นหลังช่องแชทบนมือถือ",
    "Blur level of the chat field background on mobile devices (#sheld)": "ระดับความเบลอของพื้นหลังช่องแชทบนอุปกรณ์มือถือ (#sheld)",
    "Dynamically Adjust Menu Max Height": "ปรับความสูงสูงสุดของเมนูแบบไดนามิก",
    "Dynamically adjust the menu’s maximum height based on the message input field. May not work on all devices—disable this option if the menu doesn’t close properly": "ปรับความสูงสูงสุดของเมนูแบบไดนามิกตามช่องป้อนข้อความ อาจไม่ทำงานบนอุปกรณ์ทั้งหมด—ปิดใช้งานตัวเลือกนี้หากเมนูปิดไม่ถูกต้อง",
    "Apply Theme Color to Message Background (Experimental)": "ใช้สีธีมกับพื้นหลังข้อความ (ทดลอง)",
    "Applies each character’s theme color to their message background. Requires the Character Style Customizer; per-character colors override global settings": "ใช้สีธีมของแต่ละตัวละครกับพื้นหลังข้อความของพวกเขา ต้องใช้ส่วนขยาย Character Style Customizer; สีของแต่ละตัวละครจะแทนที่การตั้งค่าส่วนกลาง",
    "Display LLM Icon in Reasoning Block": "แสดงไอคอน LLM ในบล็อกการให้เหตุผล",
    "Shows the LLM icon in the reasoning block header for clearer identification": "แสดงไอคอน LLM ในส่วนหัวของบล็อกการให้เหตุผลเพื่อการระบุที่ชัดเจนยิ่งขึ้น",
    "Lock AI Response & Character Menu Height": "ล็อคความสูงของเมนูการตอบสนอง AI และตัวละคร",
    "Fix AI config & character menus’ height to avoid display issues. Disable if using MovingUI": "แก้ไขความสูงของเมนูการตั้งค่า AI และตัวละครเพื่อหลีกเลี่ยงปัญหาการแสดงผล ปิดใช้งานหากใช้ MovingUI",
    "Inline Character, Timestamp & Icons on Mobile": "แสดงชื่อตัวละคร, การประทับเวลา และไอคอนในบรรทัดเดียวกันบนมือถือ",
    "Show character names, timestamps, and model icons in one line on mobile": "แสดงชื่อตัวละคร, การประทับเวลา และไอคอนโมเดลในบรรทัดเดียวบนมือถือ",
    "Fix AI config & character menus' height to avoid display issues. Disable if using MovingUI": "แก้ไขความสูงของเมนูการตั้งค่า AI และตัวละครเพื่อหลีกเลี่ยงปัญหาการแสดงผล ปิดใช้งานหากใช้ MovingUI",
    "Dynamically adjust the menu's maximum height based on the message input field. May not work on all devices—disable this option if the menu doesn't close properly": "ปรับความสูงสูงสุดของเมนูแบบไดนามิกตามช่องป้อนข้อความ อาจไม่ทำงานบนอุปกรณ์ทั้งหมด—ปิดใช้งานตัวเลือกนี้หากเมนูปิดไม่ถูกต้อง",
    "Applies each character's theme color to message avatar borders. Requires the Character Style Customizer; per-character colors override global settings": "ใช้สีธีมของแต่ละตัวละครกับเส้นขอบอวตารของข้อความ ต้องใช้ส่วนขยาย Character Style Customizer; สีของแต่ละตัวละครจะแทนที่การตั้งค่าส่วนกลาง",
    "Applies each character's theme color to their message background. Requires the Character Style Customizer; per-character colors override global settings": "ใช้สีธีมของแต่ละตัวละครกับพื้นหลังข้อความของพวกเขา ต้องใช้ส่วนขยาย Character Style Customizer; สีของแต่ละตัวละครจะแทนที่การตั้งค่าส่วนกลาง",
    "Disable Top Menu Animations": "ปิดใช้งานแอนิเมชันเมนูด้านบน",
    "Disable top menu animation effects for a smoother experience on mobile devices": "ปิดเอฟเฟกต์แอนิเมชันของเมนูด้านบนเพื่อประสบการณ์ที่ลื่นไหลยิ่งขึ้นบนอุปกรณ์พกพา",
    "[Echo] Minimize User Messages": "[Echo] ย่อข้อความของผู้ใช้ให้เล็กลง",
    "Hide user avatars and minimizes the height of user messages in the Echo style": "ซ่อนอวาตาร์ของผู้ใช้และย่อความสูงของข้อความในสไตล์ Echo",
    "Global Message Style": "รูปแบบข้อความสากล",
    "Message Paragraph Spacing (Top)": "ระยะห่างย่อหน้าข้อความ (บน)",
    "Sets the spacing above each paragraph in chat messages (e.g. 0.5em, 1em)": "ตั้งค่าระยะห่างด้านบนของแต่ละย่อหน้าในข้อความแชท (เช่น 0.5em, 1em)",
    "Message Paragraph Spacing (Bottom)": "ระยะห่างย่อหน้าข้อความ (ล่าง)",
    "Sets the spacing below each paragraph in chat messages (e.g. 0.5em, 1em)": "ตั้งค่าระยะห่างด้านล่างของแต่ละย่อหน้าในข้อความแชท (เช่น 0.5em, 1em)",
    "Character Name Font Size": "ขนาดตัวอักษรชื่อตัวละคร",
    "Font size for character (non-user) name text (e.g. 0.9rem, 1rem)": "ตั้งค่าขนาดตัวอักษรสำหรับชื่อตัวละคร (ที่ไม่ใช่ผู้ใช้) (เช่น 0.9rem, 1rem)",
    "User Name Font Size": "ขนาดตัวอักษรชื่อผู้ใช้",
    "Font size for user name text (e.g. 0.9rem, 1rem)": "ตั้งค่าขนาดตัวอักษรสำหรับชื่อผู้ใช้ (เช่น 0.9rem, 1rem)",
    "Message Text Font Size": "ขนาดตัวอักษรข้อความ",
    "Font size for message body text (e.g. 0.95rem, 1rem, 1.05rem)": "ตั้งค่าขนาดตัวอักษรสำหรับเนื้อหาข้อความ (เช่น 0.95rem, 1rem, 1.05rem)",
    "Message Text Letter Spacing": "ระยะห่างตัวอักษรในข้อความ",
    "Letter spacing for message body text (e.g. 0em, 0.02em)": "ตั้งค่าระยะห่างตัวอักษรสำหรับเนื้อหาข้อความ (เช่น 0em, 0.02em)",
    "Advanced Custom CSS": "CSS ที่กำหนดเองขั้นสูง",
    "Raw Custom CSS": "CSS ที่กำหนดเอง (Raw)",
    "Note: This is raw, unfiltered CSS with full support (including @import for custom fonts). Use with caution. Please use the Custom CSS option in User Settings first!!!": "หมายเหตุ: นี่คือ CSS แบบดิบที่ไม่มีการกรองและรองรับคุณสมบัติทั้งหมด (รวมถึง @import สำหรับฟอนต์ที่กำหนดเอง) โปรดใช้ด้วยความระมัดระวัง! แนะนำให้ใช้ตัวเลือก CSS ที่กำหนดเองในการตั้งค่าผู้ใช้ก่อน!!!",
    "Favorite Symbol": "สัญลักษณ์โปรด",
    "Sets the symbol displayed before a favorite character in the character management menu": "ตั้งค่าสัญลักษณ์ที่แสดงหน้าชื่อตัวละครโปรดในเมนูจัดการตัวละคร",
    "Favorite Symbol Animation": "แอนิเมชันสัญลักษณ์โปรด",
    "Enables the pulsing animation effect for the favorite symbol before character names": "เปิดใช้งานเอฟเฟกต์แอนิเมชันการเต้นของสัญลักษณ์โปรดหน้าชื่อตัวละคร",
    "[Echo] Hide User Message Illustration": "[Echo] ซ่อนภาพประกอบข้อความผู้ใช้",
    "Hide user message illustrations in Echo style": "ซ่อนภาพประกอบข้อความของผู้ใช้ในรูปแบบ Echo",
    "[Ripple] Hide User Avatar": "[Ripple] ซ่อนอวตารผู้ใช้",
    "Hide user avatars in the message for the Ripple style": "ซ่อนอวตารผู้ใช้ในข้อความสำหรับรูปแบบ Ripple",
    "Expand Lorebook Entry Input Width": "ขยายความกว้างช่องป้อนข้อมูล Lorebook",
    "Increase the width of numeric input fields in Worlds/Lorebooks for better visibility. May cause slight misalignment": "เพิ่มความกว้างของช่องป้อนข้อมูลตัวเลขใน Worlds/Lorebooks เพื่อการมองเห็นที่ดีขึ้น อาจทำให้การจัดตำแหน่งคลาดเคลื่อนเล็กน้อย",
    "Line height for message body text (e.g. 1.55em, 1.6em)": "ความสูงบรรทัดสำหรับข้อความเนื้อหา (เช่น 1.55em, 1.6em)",
    "Expand Entry Input Width": "ขยายความกว้างช่องป้อนข้อมูลของรายการ",
    "Hide the browser’s up/down arrows in number input fields to give more space for typing": "ซ่อนปุ่มลูกศรขึ้น/ลงของเบราว์เซอร์ในช่องป้อนค่าตัวเลขเพื่อเพิ่มพื้นที่สำหรับพิมพ์",
    "Compact Worlds/Lorebooks Top Bar": "ทำให้แถบด้านบนของ Worlds/Lorebooks กะทัดรัด",
    "Make the top fields in Worlds/Lorebooks more compact by reducing header padding and entry spacing": "ลดระยะห่างภายในส่วนหัวและระยะห่างระหว่างรายการ เพื่อให้ช่องข้อมูลด้านบนใน Worlds/Lorebooks กระชับยิ่งขึ้น",
    "Message Text Line Height": "ความสูงบรรทัดของข้อความ"
}
