{
    "Moonlit Echoes Theme Presets": "Cài đặt sẵn chủ đề Moonlit Echoes",
    "Primary Theme Color": "Màu chủ đề chính",
    "The main interface theme color, used for highlights and accents": "Màu chủ đề giao diện chính, được sử dụng cho các điểm nhấn và chi tiết",
    "Secondary Theme Color": "Màu chủ đề phụ",
    "A complementary secondary color, used for special highlights": "Màu phụ bổ sung, được sử dụng cho các điểm nhấn đặc biệt",
    "Top Menu Color": "Màu menu trên cùng",
    "Background color of the top menu (#top-bar)": "Màu nền của menu trên cùng (#top-bar)",
    "Menu Icon Color": "Màu biểu tượng menu",
    "Color of icons in the top menu, sidebar, and dropdown menus": "Màu của các biểu tượng trong menu trên cùng, thanh bên và menu thả xuống",
    "Chat Field Background Color": "Màu nền trường trò chuyện",
    "Background color of the chat field (#sheld)": "Màu nền của trường trò chuyện (#sheld)",
    "Background Blur Intensity": "Cường độ làm mờ nền",
    "Adjusts the blur level of the background image": "Điều chỉnh mức độ làm mờ của hình nền",
    "Chat Field Background Blur Intensity": "Cường độ làm mờ nền trường trò chuyện",
    "Blur level of the chat field background (#sheld)": "Mức độ làm mờ của nền trường trò chuyện (#sheld)",
    "Chat Field Gradient Blur": "Làm mờ chuyển sắc trường trò chuyện",
    "Subtle": "Nhẹ",
    "Applies a transparent gradient effect to the top and bottom of the chat field (#chat)": "Áp dụng hiệu ứng chuyển sắc trong suốt cho phần trên và dưới của trường trò chuyện (#chat)",
    "Chat Field Avatar Size": "Kích thước ảnh đại diện trường trò chuyện",
    "Width and height of character avatars in the chat field": "Chiều rộng và chiều cao của ảnh đại diện nhân vật trong trường trò chuyện",
    "[Echo] Message Background Avatar Width": "[Echo] Chiều rộng ảnh đại diện nền tin nhắn",
    "Width of character avatars in the message background for the Echo style": "Chiều rộng ảnh đại diện của nhân vật trong nền tin nhắn theo phong cách Echo",
    "[Whisper] Message Background Avatar Width": "[Whisper] Chiều rộng ảnh đại diện nền tin nhắn",
    "Width of character avatars in the message background for the Whisper style": "Chiều rộng ảnh đại diện của nhân vật trong nền tin nhắn theo phong cách Whisper",
    "[Whisper] Avatar Alignment": "[Whisper] Căn chỉnh ảnh đại diện",
    "Top Aligned": "Căn trên",
    "Center Aligned": "Căn giữa",
    "Bottom Aligned": "Căn dưới",
    "Vertical alignment of character avatars in the message background for the Whisper style": "Căn chỉnh theo chiều dọc của ảnh đại diện nhân vật trong nền tin nhắn theo phong cách Whisper",
    "Visual Novel Mode Chat Field Height": "Chiều cao trường trò chuyện chế độ Visual Novel",
    "Maximum height of the chat field (#sheld) in Visual Novel mode": "Chiều cao tối đa của trường trò chuyện (#sheld) ở chế độ Visual Novel",
    "Visual Novel Mode Character Portrait Gradient Transparency": "Độ trong suốt chuyển sắc chân dung nhân vật chế độ Visual Novel",
    "Bottom transparency effect for character portraits in Visual Novel mode": "Hiệu ứng trong suốt ở phần dưới cho chân dung nhân vật ở chế độ Visual Novel",
    "Enable New Mobile Input Field": "Bật trường nhập tin nhắn mới cho di động",
    "A message input field designed for mobile, providing a wider input box": "Một trường nhập tin nhắn được thiết kế cho di động, cung cấp hộp nhập rộng hơn",
    "Enable Moonlit Echoes Theme": "Bật chủ đề Moonlit Echoes",
    "Echo": "Echo (Tiếng Vang)",
    "Whisper": "Whisper (Thì Thầm)",
    "Hush": "Hush (Tĩnh Lặng)",
    "Tide": "Tide (Thủy Triều)",
    "Theme Color Settings": "Cài đặt màu chủ đề",
    "Background Settings": "Cài đặt nền",
    "Chat Interface": "Giao diện trò chuyện",
    "Visual Novel Mode": "Chế độ Visual Novel",
    "General Settings": "Cài đặt chung",
    "Advanced Settings": "Cài đặt nâng cao",
    "You are currently using the third-party extension theme": "Bạn hiện đang sử dụng chủ đề tiện ích mở rộng của bên thứ ba",
    "Thank you for choosing my theme! This extension is unofficial. For issues, please contact": "Cảm ơn bạn đã chọn chủ đề của tôi! Tiện ích mở rộng này không chính thức. Nếu có vấn đề, vui lòng liên hệ",
    "customThemeIssue": "Tiện ích mở rộng này không liên quan đến SillyTavern chính thức và có thể không tương thích với tất cả các chủ đề tùy chỉnh. Nếu gặp sự cố, vui lòng tự kiểm tra trước; nếu xác nhận sự cố do tiện ích mở rộng này gây ra, vui lòng liên hệ",
    "Invalid Moonlit Echoes theme preset format": "Định dạng cài đặt sẵn chủ đề Moonlit Echoes không hợp lệ",
    "Moonlit Echoes theme preset \"${0}\" not found": "Không tìm thấy cài đặt sẵn chủ đề Moonlit Echoes \"${0}\"",
    "Moonlit Echoes theme preset \"${0}\" exported successfully": "Xuất thành công cài đặt sẵn chủ đề Moonlit Echoes \"${0}\"",
    "Moonlit Echoes theme preset \"${0}\" updated successfully": "Cập nhật thành công cài đặt sẵn chủ đề Moonlit Echoes \"${0}\"",
    "Save New Moonlit Echoes Theme Preset": "Lưu cài đặt sẵn chủ đề Moonlit Echoes mới",
    "Please enter a name for your new Moonlit Echoes theme preset:": "Vui lòng nhập tên cho cài đặt sẵn chủ đề Moonlit Echoes mới của bạn:",
    "Confirm Overwrite": "Xác nhận ghi đè",
    "A preset named \"${0}\" already exists. Do you want to overwrite it?": "Một cài đặt sẵn có tên \"${0}\" đã tồn tại. Bạn có muốn ghi đè lên nó không?",
    "Preset \"${0}\" saved successfully": "Lưu thành công cài đặt sẵn \"${0}\"",
    "Cannot delete the only preset": "Không thể xóa cài đặt sẵn duy nhất",
    "Cannot delete the Moonlit Echoes theme preset": "Không thể xóa cài đặt sẵn chủ đề Moonlit Echoes",
    "File input element not found": "Không tìm thấy phần tử nhập tệp",
    "Invalid Moonlit Echoes theme preset file format": "Định dạng tệp cài đặt sẵn chủ đề Moonlit Echoes không hợp lệ",
    "Delete Theme Preset": "Xóa cài đặt sẵn chủ đề",
    "Are you sure you want to delete the preset \"${0}\"?": "Bạn có chắc chắn muốn xóa cài đặt sẵn \"${0}\" không?",
    "Preset \"${0}\" imported successfully": "Nhập thành công cài đặt sẵn \"${0}\"",
    "Import Preset": "Nhập cài đặt sẵn",
    "Export Preset": "Xuất cài đặt sẵn",
    "Update Current Preset": "Cập nhật cài đặt sẵn hiện tại",
    "Save as New Preset": "Lưu thành cài đặt sẵn mới",
    "Delete Preset": "Xóa cài đặt sẵn",
    "Error importing preset:": "Lỗi khi nhập cài đặt sẵn:",
    "Blurry or thumbnail-sized character images in chat?": "Hình ảnh nhân vật trong cuộc trò chuyện bị mờ hoặc có kích thước thu nhỏ?",
    "SillyTavern's default thumbnail scaling causes avatars to use lower-resolution images. fix this, edit": "Việc chia tỷ lệ hình thu nhỏ mặc định của SillyTavern khiến ảnh đại diện sử dụng hình ảnh có độ phân giải thấp hơn. để khắc phục điều này, hãy chỉnh sửa",
    "and fully restart the SillyTavern server.": "và khởi động lại hoàn toàn máy chủ SillyTavern.",
    "Recommended settings (please scroll):": "Cài đặt được đề xuất (vui lòng cuộn):",
    "Ripple": "Ripple (Gợn Sóng)",
    "[Ripple] Message Avatar Width": "[Ripple] Chiều rộng ảnh đại diện tin nhắn",
    "Width of character avatars in the message for the Ripple style": "Chiều rộng của ảnh đại diện nhân vật trong tin nhắn theo phong cách Ripple",
    "[Ripple] Mobile Message Avatar Width": "[Ripple] Chiều rộng ảnh đại diện tin nhắn trên di động",
    "Width of character avatars in the message for the mobile Ripple style": "Chiều rộng của ảnh đại diện nhân vật trong tin nhắn theo phong cách Ripple trên di động",
    "Hide Additional Message Details": "Ẩn chi tiết tin nhắn bổ sung",
    "Message additional details (name, ID, time, token counter, etc.) show only on hover or click": "Chi tiết bổ sung của tin nhắn (tên, ID, thời gian, bộ đếm token, v.v.) chỉ hiển thị khi di chuột qua hoặc nhấp vào",
    "Preset \"${0}\" deleted successfully": "Đã xóa thành công cài đặt sẵn \"${0}\"",
    "Message Details Animation Duration": "Thời lượng hoạt ảnh chi tiết tin nhắn",
    "Controls the animation speed for message details appearing/disappearing (e.g. 0.5s, 1.2s)": "Kiểm soát tốc độ hoạt ảnh cho chi tiết tin nhắn xuất hiện/biến mất (ví dụ: 0.5s, 1.2s)",
    "Scrollbar Color": "Màu thanh cuộn",
    "The scrollbar color on SillyTavern": "Màu thanh cuộn trên SillyTavern",
    "Maximum Context Marker Style": "Kiểu đánh dấu ngữ cảnh tối đa",
    "Line style for the maximum context marker": "Kiểu đường kẻ cho dấu ngữ cảnh tối đa",
    "Main Background Color": "Màu nền chính",
    "The primary background color used across various menus and buttons": "Màu nền chính được sử dụng trên các menu và nút khác nhau",
    "Secondary Background Color": "Màu nền phụ",
    "The secondary background color used across various menus and buttons": "Màu nền phụ được sử dụng trên các menu và nút khác nhau",
    "Background Image Opacity": "Độ mờ của hình nền",
    "Adjusts the opacity level of the background image": "Điều chỉnh mức độ mờ của hình nền",
    "[Echo] Message Background Avatar Height": "[Echo] Chiều cao ảnh đại diện nền tin nhắn",
    "Height of character avatars in the message background for the Echo style": "Chiều cao ảnh đại diện của nhân vật trong nền tin nhắn theo phong cách Echo",
    "Justify Paragraph Text": "Căn đều văn bản đoạn văn",
    "Aligns paragraph text for Chinese, Japanese, and Korean for better readability; not suitable for English layout": "Căn chỉnh văn bản đoạn văn cho tiếng Trung, tiếng Nhật và tiếng Hàn để dễ đọc hơn; không phù hợp với bố cục tiếng Anh",
    "Please refer to the": "Vui lòng tham khảo",
    "and complete the necessary setup.": "và hoàn tất các thiết lập cần thiết.",
    "Fix Tablet Menu Layout": "Sửa bố cục menu máy tính bảng",
    "Optimized for tablet users to prevent menu layout issues. Note: Tablet support in SillyTavern is currently limited and may not address all issues": "Được tối ưu hóa cho người dùng máy tính bảng để ngăn ngừa các sự cố bố cục menu. Lưu ý: Hỗ trợ máy tính bảng trong SillyTavern hiện bị hạn chế và có thể không giải quyết được tất cả các sự cố",
    "Enable Mobile Hidden Scrollbar": "Bật thanh cuộn ẩn trên di động",
    "Hides scrollbars for a clean mobile interface": "Ẩn thanh cuộn để có giao diện di động gọn gàng.",
    "Apply Theme Colors to More UI Elements": "Áp dụng màu chủ đề cho nhiều yếu tố giao diện người dùng hơn",
    "Applies theme colors to more parts of the UI for a more personalized look": "Áp dụng màu chủ đề cho nhiều phần hơn của giao diện người dùng để có giao diện được cá nhân hóa hơn",
    "Enable Horizontal HotSwap Scroll on Mobile": "Bật cuộn ngang HotSwap trên di động",
    "Allows horizontal scrolling for the quick character selection menu (#HotSwapWrapper) on mobile": "Cho phép cuộn ngang cho menu chọn nhân vật nhanh (#HotSwapWrapper) trên di động",
    "Increase Chat Input Field Spacing on Desktop & Tablet": "Tăng khoảng cách trường nhập trò chuyện trên máy tính để bàn & máy tính bảng",
    "Add extra bottom margin to chat input fields on larger screens (tablets and desktops)": "Thêm lề dưới bổ sung cho các trường nhập trò chuyện trên màn hình lớn hơn (máy tính bảng và máy tính để bàn)",
    "Increase Chat Input Field Spacing on Mobile": "Tăng khoảng cách trường nhập trò chuyện trên di động",
    "Add extra bottom padding to chat input fields on mobile devices (screen width ≤ 1000px)": "Thêm phần đệm dưới bổ sung vào các trường nhập trò chuyện trên thiết bị di động (chiều rộng màn hình ≤ 1000px)",
    "[Echo] Mobile Message Background Avatar Width": "[Echo] Chiều rộng ảnh đại diện nền tin nhắn trên di động",
    "Width of character avatars in the message background for the Echo style on mobile devices": "Chiều rộng của ảnh đại diện nhân vật trong nền tin nhắn theo phong cách Echo trên thiết bị di động",
    "[Echo] Mobile Message Background Avatar Height": "[Echo] Chiều cao ảnh đại diện nền tin nhắn trên di động",
    "Height of character avatars in the message background for the Echo style on mobile devices": "Chiều cao của ảnh đại diện nhân vật trong nền tin nhắn theo phong cách Echo trên thiết bị di động",
    "Hide Mobile Echo-Style Message Background": "Ẩn nền tin nhắn kiểu Echo trên di động",
    "Hide the echo-style background illustration for character messages on mobile devices": "Ẩn hình minh họa nền kiểu echo cho tin nhắn của nhân vật trên thiết bị di động",
    "Disable All Border Radius": "Tắt tất cả bán kính đường viền",
    "Completely disable all border-radius and outline-radius effects throughout the UI": "Vô hiệu hóa hoàn toàn tất cả các hiệu ứng bán kính đường viền và bán kính đường viền ngoài trong toàn bộ giao diện người dùng",
    "Hide Avatar Border": "Ẩn viền ảnh đại diện",
    "Hide the border around character avatars in chat messages": "Ẩn đường viền xung quanh ảnh đại diện nhân vật trong tin nhắn trò chuyện",
    "Move QRs Bar Below Input on Mobile": "Di chuyển thanh QRs xuống dưới ô nhập trên di động",
    "On mobile devices (screen width ≤ 1000px), move the QRs menu below the chat input to avoid interference from message input": "Trên thiết bị di động (chiều rộng màn hình ≤ 1000px), di chuyển menu QRs xuống dưới ô nhập trò chuyện để tránh bị nhiễu từ việc nhập tin nhắn.",
    "Mobile QRs Bar Height": "Chiều cao thanh QRs trên di động",
    "Sets the maximum number of visible rows in the QRs bar on mobile devices (supports scrolling)": "Đặt số hàng hiển thị tối đa trong thanh QRs trên thiết bị di động (hỗ trợ cuộn)",
    "Compact (1 row)": "Nhỏ gọn (1 hàng)",
    "Default (2 rows)": "Mặc định (2 hàng)",
    "Extended (3 rows)": "Mở rộng (3 hàng)",
    "Message Paragraph Spacing": "Khoảng cách đoạn tin nhắn",
    "Sets the spacing between paragraphs in chat messages (e.g. 0.5em, 1em)": "Đặt khoảng cách giữa các đoạn trong tin nhắn trò chuyện (ví dụ: 0.5em, 1em)",
    "Core Settings": "Cài đặt cốt lõi",
    "Background Effects": "Hiệu ứng nền",
    "Theme Extras": "Tiện ích bổ sung chủ đề",
    "General Chat Settings": "Cài đặt trò chuyện chung",
    "Echo Style Settings": "Cài đặt phong cách Echo",
    "Whisper Style Settings": "Cài đặt phong cách Whisper",
    "Ripple Style Settings": "Cài đặt phong cách Ripple",
    "[Echo] Hide Message Background on Mobile": "[Echo] Ẩn nền tin nhắn trên di động",
    "Hide message background illustrations on mobile for the Echo style": "Ẩn hình minh họa nền tin nhắn trên di động cho phong cách Echo",
    "Mobile Devices": "Thiết bị di động",
    "Mobile Global Settings": "Cài đặt chung cho di động",
    "Mobile Detailed Settings": "Cài đặt chi tiết cho di động",
    "Open Moonlit Echoes Theme Settings": "Mở cài đặt chủ đề Moonlit Echoes",
    "Chat Style Slash Commands": "Lệnh gạch chéo kiểu trò chuyện",
    "Available commands:": "Các lệnh có sẵn:",
    "SillyTavern Safe Switch Commands:": "Lệnh chuyển đổi an toàn SillyTavern:",
    "Switch to Echo style": "Chuyển sang phong cách Echo",
    "Switch to Whisper style": "Chuyển sang phong cách Whisper",
    "Switch to Hush style": "Chuyển sang phong cách Hush",
    "Switch to Ripple style": "Chuyển sang phong cách Ripple",
    "Switch to Tide style": "Chuyển sang phong cách Tide",
    "Moonlit Echoes Styles:": "Các phong cách Moonlit Echoes:",
    "SillyTavern Built-in Styles:": "Các phong cách tích hợp của SillyTavern:",
    "Switch to Flat style": "Chuyển sang phong cách Flat",
    "Switch to Bubble style": "Chuyển sang phong cách Bubble",
    "Switch to Document style": "Chuyển sang phong cách Document",
    "For more commands, see": "Để biết thêm lệnh, hãy xem:",
    "STscript Reference": "Tài liệu tham khảo STscript",
    "Apply Theme Color to Message Avatar Border": "Áp dụng màu chủ đề vào viền ảnh đại diện tin nhắn",
    "Applies each character’s theme color to message avatar borders. Requires the Character Style Customizer; per-character colors override global settings": "Áp dụng màu chủ đề của mỗi nhân vật vào viền ảnh đại diện tin nhắn. Yêu cầu Tiện ích tùy chỉnh kiểu nhân vật; màu sắc của từng nhân vật sẽ ghi đè cài đặt chung",
    "Mobile Chat Field Background Blur Intensity": "Cường độ làm mờ nền trường trò chuyện trên di động",
    "Blur level of the chat field background on mobile devices (#sheld)": "Mức độ làm mờ của nền trường trò chuyện trên thiết bị di động (#sheld)",
    "Dynamically Adjust Menu Max Height": "Tự động điều chỉnh chiều cao tối đa của menu",
    "Dynamically adjust the menu’s maximum height based on the message input field. May not work on all devices—disable this option if the menu doesn’t close properly": "Tự động điều chỉnh chiều cao tối đa của menu dựa trên trường nhập tin nhắn. Có thể không hoạt động trên tất cả các thiết bị—hãy tắt tùy chọn này nếu menu không đóng đúng cách",
    "Apply Theme Color to Message Background (Experimental)": "Áp dụng màu chủ đề vào nền tin nhắn (Thử nghiệm)",
    "Applies each character’s theme color to their message background. Requires the Character Style Customizer; per-character colors override global settings": "Áp dụng màu chủ đề của mỗi nhân vật vào nền tin nhắn của họ. Yêu cầu Tiện ích tùy chỉnh kiểu nhân vật; màu sắc của từng nhân vật sẽ ghi đè cài đặt chung",
    "Display LLM Icon in Reasoning Block": "Hiển thị biểu tượng LLM trong khối suy luận",
    "Shows the LLM icon in the reasoning block header for clearer identification": "Hiển thị biểu tượng LLM trong tiêu đề khối suy luận để nhận dạng rõ ràng hơn",
    "Lock AI Response & Character Menu Height": "Khóa chiều cao menu phản hồi AI & nhân vật",
    "Fix AI config & character menus’ height to avoid display issues. Disable if using MovingUI": "Sửa chiều cao menu cấu hình AI và nhân vật để tránh các vấn đề hiển thị. Tắt nếu sử dụng MovingUI",
    "Inline Character, Timestamp & Icons on Mobile": "Hiển thị cùng dòng nhân vật, dấu thời gian và biểu tượng trên di động",
    "Show character names, timestamps, and model icons in one line on mobile": "Hiển thị tên nhân vật, dấu thời gian và biểu tượng mô hình trên cùng một dòng trên di động",
    "Fix AI config & character menus' height to avoid display issues. Disable if using MovingUI": "Sửa chiều cao menu cấu hình AI và nhân vật để tránh các vấn đề hiển thị. Tắt nếu sử dụng MovingUI",
    "Dynamically adjust the menu's maximum height based on the message input field. May not work on all devices—disable this option if the menu doesn't close properly": "Tự động điều chỉnh chiều cao tối đa của menu dựa trên trường nhập tin nhắn. Có thể không hoạt động trên tất cả các thiết bị—hãy tắt tùy chọn này nếu menu không đóng đúng cách.",
    "Applies each character's theme color to message avatar borders. Requires the Character Style Customizer; per-character colors override global settings": "Áp dụng màu chủ đề của mỗi nhân vật vào viền ảnh đại diện tin nhắn. Yêu cầu Tiện ích tùy chỉnh kiểu nhân vật; màu sắc của từng nhân vật sẽ ghi đè cài đặt chung",
    "Applies each character's theme color to their message background. Requires the Character Style Customizer; per-character colors override global settings": "Áp dụng màu chủ đề của mỗi nhân vật vào nền tin nhắn của họ. Yêu cầu Tiện ích tùy chỉnh kiểu nhân vật; màu sắc của từng nhân vật sẽ ghi đè cài đặt chung",
    "Disable Top Menu Animations": "Tắt hoạt ảnh menu trên cùng",
    "Disable top menu animation effects for a smoother experience on mobile devices": "Tắt các hiệu ứng hoạt ảnh của menu trên cùng để có trải nghiệm mượt mà hơn trên thiết bị di động",
    "[Echo] Minimize User Messages": "[Echo] Thu gọn tin nhắn của người dùng",
    "Hide user avatars and minimizes the height of user messages in the Echo style": "Ẩn ảnh đại diện người dùng và thu gọn chiều cao tin nhắn trong kiểu Echo",
    "Global Message Style": "Kiểu tin nhắn toàn cục",
    "Message Paragraph Spacing (Top)": "Giãn cách đoạn tin nhắn (Trên)",
    "Sets the spacing above each paragraph in chat messages (e.g. 0.5em, 1em)": "Cài đặt khoảng cách phía trên mỗi đoạn trong tin nhắn trò chuyện (ví dụ: 0.5em, 1em)",
    "Message Paragraph Spacing (Bottom)": "Giãn cách đoạn tin nhắn (Dưới)",
    "Sets the spacing below each paragraph in chat messages (e.g. 0.5em, 1em)": "Cài đặt khoảng cách phía dưới mỗi đoạn trong tin nhắn trò chuyện (ví dụ: 0.5em, 1em)",
    "Character Name Font Size": "Cỡ chữ tên nhân vật",
    "Font size for character (non-user) name text (e.g. 0.9rem, 1rem)": "Cỡ chữ cho văn bản tên nhân vật (không phải người dùng) (ví dụ: 0.9rem, 1rem)",
    "User Name Font Size": "Cỡ chữ tên người dùng",
    "Font size for user name text (e.g. 0.9rem, 1rem)": "Cỡ chữ cho văn bản tên người dùng (ví dụ: 0.9rem, 1rem)",
    "Message Text Font Size": "Cỡ chữ văn bản tin nhắn",
    "Font size for message body text (e.g. 0.95rem, 1rem, 1.05rem)": "Cỡ chữ cho nội dung tin nhắn (ví dụ: 0.95rem, 1rem, 1.05rem)",
    "Message Text Letter Spacing": "Khoảng cách ký tự văn bản tin nhắn",
    "Letter spacing for message body text (e.g. 0em, 0.02em)": "Khoảng cách ký tự cho nội dung tin nhắn (ví dụ: 0em, 0.02em)",
    "Advanced Custom CSS": "CSS tùy chỉnh nâng cao",
    "Raw Custom CSS": "CSS tùy chỉnh thô",
    "Note: This is raw, unfiltered CSS with full support (including @import for custom fonts). Use with caution. Please use the Custom CSS option in User Settings first!!!": "Lưu ý: Đây là CSS thô, chưa được lọc và hỗ trợ đầy đủ tính năng (bao gồm @import để tải phông chữ tùy chỉnh). Vui lòng sử dụng cẩn thận. Nên ưu tiên sử dụng tùy chọn CSS tùy chỉnh trong Cài đặt người dùng!!!",
    "Favorite Symbol": "Biểu tượng yêu thích",
    "Sets the symbol displayed before a favorite character in the character management menu": "Cài đặt biểu tượng hiển thị trước tên nhân vật yêu thích trong menu quản lý nhân vật",
    "Favorite Symbol Animation": "Hiệu ứng động biểu tượng yêu thích",
    "Enables the pulsing animation effect for the favorite symbol before character names": "Bật hiệu ứng động nhấp nháy cho biểu tượng yêu thích trước tên nhân vật",
    "[Echo] Hide User Message Illustration": "[Echo] Ẩn hình minh họa tin nhắn người dùng",
    "Hide user message illustrations in Echo style": "Ẩn hình minh họa trong tin nhắn của người dùng theo phong cách Echo",
    "[Ripple] Hide User Avatar": "[Ripple] Ẩn ảnh đại diện người dùng",
    "Hide user avatars in the message for the Ripple style": "Ẩn ảnh đại diện của người dùng trong tin nhắn theo phong cách Ripple",
    "Expand Lorebook Entry Input Width": "Mở rộng chiều rộng ô nhập giá trị trong Sách Thế Giới",
    "Increase the width of numeric input fields in Worlds/Lorebooks for better visibility. May cause slight misalignment": "Tăng chiều rộng của các trường nhập số trong Sách Thế Giới để dễ nhìn hơn. Có thể gây ra lệch hàng nhẹ",
    "Line height for message body text (e.g. 1.55em, 1.6em)": "Chiều cao dòng cho văn bản tin nhắn (ví dụ: 1.55em, 1.6em)",
    "Expand Entry Input Width": "Mở rộng chiều rộng trường nhập mục",
    "Hide the browser’s up/down arrows in number input fields to give more space for typing": "Ẩn các mũi tên lên/xuống của trình duyệt trong trường nhập số để có thêm không gian gõ",
    "Compact Worlds/Lorebooks Top Bar": "Thu gọn thanh trên cùng của Worlds/Lorebooks",
    "Make the top fields in Worlds/Lorebooks more compact by reducing header padding and entry spacing": "Giảm padding của phần tiêu đề và khoảng cách giữa các mục để các trường trên cùng trong Worlds/Lorebooks gọn hơn",
    "Message Text Line Height": "Chiều cao dòng của văn bản tin nhắn"
}
